with open('file.txt','r') as file:
    s = file.read()
'''*****************************************************************************
 Μετατροπή κάθε χαρακτήρα του κειμένου του αρχείου στον αντίστοιχο αριθμό ASCII
*****************************************************************************'''
a=[ord(c) for c in s]
'''********************************
Συνάρτηση που κρατά τους περιττούς
********************************'''
def odd(b):
    if b%2==1:
        return b
c=[odd(b) for b in a]
'''*************************************************
Αφαιρώ τους αριθμούς που δεν αντιστοιχούν σε γράμμα
*************************************************'''
for i in range(c.count(None)):
    c.remove(None)
p=0
while p < 65:
    for i in range(c.count(p)):
        c.remove(p)
    p += 1
p=91
while p < 97:
    for i in range(c.count(p)):
        c.remove(p)
    p += 1
p=123
while p < 255:
    for i in range(c.count(p)):
        c.remove(p)
    p += 1
'''*****************************************************************
Βρίσκω ποσοστό εμφάνησης του κάθε γράμματος και το εκτυπώνω σαν (*)
*****************************************************************'''
for i in range(0, 255):
    x=(c.count(i)*100)/len(c)
    if x>0 and x<=1:
        print('Ποσοστό εμφάνησης του', chr(i), '=', '*')
    for j in range(2, 102):
        if x>j-1 and x<=j:
            print('Ποσοστό εμφάνησης του', chr(i), '=', '*'*(j))
