import random
'''***********************************************************
Συνάρτηση που βρίσκει τον ν-οστο όρο της ακολουθίας Fibonacci
***********************************************************'''
def fibo(x):
    i=1
    j=1
    for k in range(x-2):
        tmp=i
        i=i+j
        j=tmp
    return i
o = int(input("Εισάγετε επιθυμητό όρο:"))
p = fibo(o)
'''***********************************************************
Ελέγχω αν ο ν-οστος όρο της ακολουθίας Fibonacci είναι πρώτος
***********************************************************'''
count=0
for i in range(20):
    a = random.randint(0, p-1)
    if (a**p)%p==(a%p):
        count+=1
if count==20:
    print("Ο ",o,"ος όρος ειναι ο",p,"και είναι πρώτος!")
else:
    print("Ο",o,"ος όρος ειναι ο",p,"και δεν είναι πρώτος!")
